burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_can.h
#ifdef GD32E518
/* CAN FD transmitter delay compensation parameters struct */
typedef struct {
    uint32_t tdc_mode;                                                  /*!< transmitter delay compensation mode */
    uint8_t tdc_filter;                                                 /*!< transmitter delay compensation filter */
    uint8_t tdc_offset;                                                 /*!< transmitter delay compensation offset */
} can_fd_tdc_struct;

/* CAN initiliaze FD frame parameters struct */
typedef struct {
    ControlStatus fd_frame;                                             /*!< FD operation function */
    ControlStatus excp_event_detect;                                    /*!< protocol exception event detection function*/
    ControlStatus delay_compensation;                                   /*!< transmitter delay compensation mode */
    can_fd_tdc_struct *p_delay_compensation;                            /*!< pointer to the struct of the transmitter delay compensation */
    uint32_t iso_bosch;                                                 /*!< ISO/Bosch mode choice */
    uint32_t esi_mode;                                                  /*!< error state indicator mode */
    uint8_t data_resync_jump_width;                                     /*!< CAN resynchronization jump width */
    uint8_t data_time_segment_1;                                        /*!< time segment 1 */
    uint8_t data_time_segment_2;                                        /*!< time segment 2 */
    uint16_t data_prescaler;                                            /*!< baudrate prescaler */
} can_fdframe_struct;

/* CAN transmit message struct */
typedef struct {
    uint32_t tx_sfid;                                                   /*!< standard format frame identifier */
    uint32_t tx_efid;                                                   /*!< extended format frame identifier */
    uint8_t tx_ff;                                                      /*!< format of frame, standard or extended format */
    uint8_t tx_ft;                                                      /*!< type of frame, data or remote */
    uint8_t tx_dlen;                                                    /*!< data length */
    uint8_t tx_data[64];                                                /*!< transmit data */
    uint8_t fd_flag;                                                    /*!< CAN FD frame flag */
    uint8_t fd_brs;                                                     /*!< bit rate of data switch */
    uint8_t fd_esi;                                                     /*!< error status indicator */
} can_trasnmit_message_struct;

/* CAN receive message struct */
typedef struct {
    uint32_t rx_sfid;                                                   /*!< standard format frame identifier */
    uint32_t rx_efid;                                                   /*!< extended format frame identifier */
    uint8_t rx_ff;                                                      /*!< format of frame, standard or extended format */
    uint8_t rx_ft;                                                      /*!< type of frame, data or remote */
    uint8_t rx_dlen;                                                    /*!< data length */
    uint8_t rx_data[64];                                                /*!< receive data */
    uint8_t rx_fi;                                                      /*!< filtering index */
    uint8_t fd_flag;                                                    /*!< CAN FD frame flag */
    uint8_t fd_brs;                                                     /*!< bit rate of data switch */
    uint8_t fd_esi;                                                     /*!< error status indicator */
} can_receive_message_struct;
#else
/* CAN transmit message struct */
typedef struct {
    uint32_t tx_sfid;                                                   /*!< standard format frame identifier */
    uint32_t tx_efid;                                                   /*!< extended format frame identifier */
    uint8_t tx_ff;                                                      /*!< format of frame, standard or extended format */
    uint8_t tx_ft;                                                      /*!< type of frame, data or remote */
    uint8_t tx_dlen;                                                    /*!< data length */
    uint8_t tx_data[8];                                                 /*!< transmit data */
} can_trasnmit_message_struct;

/* CAN receive message struct */
typedef struct {
    uint32_t rx_sfid;                                                   /*!< standard format frame identifier */
    uint32_t rx_efid;                                                   /*!< extended format frame identifier */
    uint8_t rx_ff;                                                      /*!< format of frame, standard or extended format */
    uint8_t rx_ft;                                                      /*!< type of frame, data or remote */
    uint8_t rx_dlen;                                                    /*!< data length */
    uint8_t rx_data[8];                                                 /*!< receive data */
    uint8_t rx_fi;                                                      /*!< filtering index */
} can_receive_message_struct;
#endif /* GD32E518 */

/* CAN filter parameters struct */
typedef struct {
    uint16_t filter_list_high;                                          /*!< filter list number high bits*/
    uint16_t filter_list_low;                                           /*!< filter list number low bits */
    uint16_t filter_mask_high;                                          /*!< filter mask number high bits */
    uint16_t filter_mask_low;                                           /*!< filter mask number low bits */
    uint16_t filter_fifo_number;                                        /*!< receive FIFO associated with the filter */
    uint16_t filter_number;                                             /*!< filter number */
    uint16_t filter_mode;                                               /*!< filter mode, list or mask */
    uint16_t filter_bits;                                               /*!< filter scale */
    ControlStatus filter_enable;                                        /*!< filter work or not */
} can_filter_parameter_struct;

/* CAN errors */
typedef enum {
    CAN_ERROR_NONE = 0U,                                                /*!< no error */
    CAN_ERROR_FILL,                                                     /*!< fill error */
    CAN_ERROR_FORMATE,                                                  /*!< format error */
    CAN_ERROR_ACK,                                                      /*!< ACK error */
    CAN_ERROR_BITRECESSIVE,                                             /*!< bit recessive error */
    CAN_ERROR_BITDOMINANTER,                                            /*!< bit dominant error */
    CAN_ERROR_CRC,                                                      /*!< CRC error */
    CAN_ERROR_SOFTWARECFG,                                              /*!< software configure */
} can_error_enum;

/* transmit states */
typedef enum {
    CAN_TRANSMIT_FAILED = 0U,                                           /*!< CAN transmitted failure */
    CAN_TRANSMIT_OK = 1U,                                               /*!< CAN transmitted success */
    CAN_TRANSMIT_PENDING = 2U,                                          /*!< CAN transmitted pending */
    CAN_TRANSMIT_NOMAILBOX = 4U,                                        /*!< no empty mailbox to be used for CAN */
} can_transmit_state_enum;

/* format and fifo states */
typedef enum {
    CAN_STANDARD_FIFO0 = 0U,                                            /*!< standard frame and used FIFO0 */
    CAN_STANDARD_FIFO1,                                                 /*!< standard frame and used FIFO1 */
    CAN_EXTENDED_FIFO0,                                                 /*!< extended frame and used FIFO0 */
    CAN_EXTENDED_FIFO1,                                                 /*!< extended frame and used FIFO1 */
} can_format_fifo_enum;

