burakenez/gd32e51x-demo-suites-cmake-vscode/Drivers/GD32E51x_standard_peripheral/Include/gd32e51x_can.h
#ifdef GD32E518
/* CAN data bit resynchronisation jump width */
#define CAN_DBT_DSJW_1TQ                   ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_DBT_DSJW_2TQ                   ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_DBT_DSJW_3TQ                   ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_DBT_DSJW_4TQ                   ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_DBT_DSJW_5TQ                   ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_DBT_DSJW_6TQ                   ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_DBT_DSJW_7TQ                   ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_DBT_DSJW_8TQ                   ((uint8_t)0x07U)             /*!< 8 time quanta */

/* CAN date bit time segment 1 */
#define CAN_DBT_DBS1_1TQ                   ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_DBT_DBS1_2TQ                   ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_DBT_DBS1_3TQ                   ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_DBT_DBS1_4TQ                   ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_DBT_DBS1_5TQ                   ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_DBT_DBS1_6TQ                   ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_DBT_DBS1_7TQ                   ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_DBT_DBS1_8TQ                   ((uint8_t)0x07U)             /*!< 8 time quanta */
#define CAN_DBT_DBS1_9TQ                   ((uint8_t)0x08U)             /*!< 9 time quanta */
#define CAN_DBT_DBS1_10TQ                  ((uint8_t)0x09U)             /*!< 10 time quanta */
#define CAN_DBT_DBS1_11TQ                  ((uint8_t)0x0AU)             /*!< 11 time quanta */
#define CAN_DBT_DBS1_12TQ                  ((uint8_t)0x0BU)             /*!< 12 time quanta */
#define CAN_DBT_DBS1_13TQ                  ((uint8_t)0x0CU)             /*!< 13 time quanta */
#define CAN_DBT_DBS1_14TQ                  ((uint8_t)0x0DU)             /*!< 14 time quanta */
#define CAN_DBT_DBS1_15TQ                  ((uint8_t)0x0EU)             /*!< 15 time quanta */
#define CAN_DBT_DBS1_16TQ                  ((uint8_t)0x0FU)             /*!< 16 time quanta */

/* CAN date bit time segment 2 */
#define CAN_DBT_DBS2_1TQ                   ((uint8_t)0x00U)             /*!< 1 time quanta */
#define CAN_DBT_DBS2_2TQ                   ((uint8_t)0x01U)             /*!< 2 time quanta */
#define CAN_DBT_DBS2_3TQ                   ((uint8_t)0x02U)             /*!< 3 time quanta */
#define CAN_DBT_DBS2_4TQ                   ((uint8_t)0x03U)             /*!< 4 time quanta */
#define CAN_DBT_DBS2_5TQ                   ((uint8_t)0x04U)             /*!< 5 time quanta */
#define CAN_DBT_DBS2_6TQ                   ((uint8_t)0x05U)             /*!< 6 time quanta */
#define CAN_DBT_DBS2_7TQ                   ((uint8_t)0x06U)             /*!< 7 time quanta */
#define CAN_DBT_DBS2_8TQ                   ((uint8_t)0x07U)             /*!< 8 time quanta */
#endif

/* CAN mailbox number */
#define CAN_MAILBOX0                       ((uint8_t)0x00U)             /*!< mailbox0 */
#define CAN_MAILBOX1                       ((uint8_t)0x01U)             /*!< mailbox1 */
#define CAN_MAILBOX2                       ((uint8_t)0x02U)             /*!< mailbox2 */
#define CAN_NOMAILBOX                      ((uint8_t)0x03U)             /*!< no mailbox empty */

/* CAN frame format */
#define CAN_FF_STANDARD                    ((uint32_t)0x00000000U)      /*!< standard frame */
#define CAN_FF_EXTENDED                    ((uint32_t)0x00000004U)      /*!< extended frame */

/* CAN receive fifo */
#define CAN_FIFO0                          ((uint8_t)0x00U)             /*!< receive FIFO0 */
#define CAN_FIFO1                          ((uint8_t)0x01U)             /*!< receive FIFO1 */

/* frame number of receive fifo */
#define CAN_RFIF_RFL_MASK                  ((uint32_t)0x00000003U)      /*!< mask for frame number in receive FIFOx */

#define CAN_SFID_MASK                      ((uint32_t)0x000007FFU)      /*!< mask of standard identifier */
#define CAN_EFID_MASK                      ((uint32_t)0x1FFFFFFFU)      /*!< mask of extended identifier */

/* CAN working mode */
#define CAN_MODE_INITIALIZE                ((uint8_t)0x01U)             /*!< CAN initialize mode */
#define CAN_MODE_NORMAL                    ((uint8_t)0x02U)             /*!< CAN normal mode */
#define CAN_MODE_SLEEP                     ((uint8_t)0x04U)             /*!< CAN sleep mode */

/* filter bits */
#define CAN_FILTERBITS_16BIT               ((uint8_t)0x00U)             /*!< CAN filter 16 bits */
#define CAN_FILTERBITS_32BIT               ((uint8_t)0x01U)             /*!< CAN filter 32 bits */

/* filter mode */
#define CAN_FILTERMODE_MASK                ((uint8_t)0x00U)             /*!< mask mode */
#define CAN_FILTERMODE_LIST                ((uint8_t)0x01U)             /*!< list mode */

/* filter 16 bits mask */
#define CAN_FILTER_MASK_16BITS             ((uint32_t)0x0000FFFFU)      /*!< can filter 16 bits mask */

/* frame type */
#define CAN_FT_DATA                        ((uint32_t)0x00000000U)      /*!< data frame */
#define CAN_FT_REMOTE                      ((uint32_t)0x00000002U)      /*!< remote frame */

#ifdef GD32E518
#define CAN_ESIMOD_HARDWARE                ((uint32_t)0x00000000U)      /*!< displays the node error state by hardware */
#define CAN_ESIMOD_SOFTWARE                CAN_FDCTL_ESIMOD             /*!< displays the node error state by software */

#define CAN_TDCMOD_CALC_AND_OFFSET         ((uint32_t)0x00000000U)      /*!< measurement and offset */
#define CAN_TDCMOD_OFFSET                  CAN_FDCTL_TDCMOD             /*!< only offset */

#define CAN_FDMOD_ISO                      ((uint32_t)0x00000000U)      /*!< ISO mode */
#define CAN_FDMOD_BOSCH                    CAN_FDCTL_NISO               /*!< BOSCH mode */

/* CAN FD frame flag */
#define CAN_FDF_CLASSIC                    (0U)                         /*!< classical frames */
#define CAN_FDF_FDFRAME                    (1U)                         /*!< FD frames */

/* bit rate of data switch */
#define CAN_BRS_DISABLE                    (0U)                         /*!< bit rate not switch */
#define CAN_BRS_ENABLE                     (1U)                         /*!< the bit rate shall be switched */

/* error status indicator */
#define CAN_ESI_DOMINANT                   (0U)                         /*!< transmit the dominant bit in ESI phase */
#define CAN_ESI_RECESSIVE                  (1U)                         /*!< transmit the recessive bit in ESI phase */

#endif /* GD32E518 */

/* CAN timeout */
#define CAN_TIMEOUT                        ((uint32_t)0x0000FFFFU)      /*!< timeout value */

/* interrupt enable bits */
#define CAN_INT_TME                        CAN_INTEN_TMEIE              /*!< transmit mailbox empty interrupt enable */
#define CAN_INT_RFNE0                      CAN_INTEN_RFNEIE0            /*!< receive FIFO0 not empty interrupt enable */
#define CAN_INT_RFF0                       CAN_INTEN_RFFIE0             /*!< receive FIFO0 full interrupt enable */
#define CAN_INT_RFO0                       CAN_INTEN_RFOIE0             /*!< receive FIFO0 overfull interrupt enable */
#define CAN_INT_RFNE1                      CAN_INTEN_RFNEIE1            /*!< receive FIFO1 not empty interrupt enable */
#define CAN_INT_RFF1                       CAN_INTEN_RFFIE1             /*!< receive FIFO1 full interrupt enable */
#define CAN_INT_RFO1                       CAN_INTEN_RFOIE1             /*!< receive FIFO1 overfull interrupt enable */
#define CAN_INT_WERR                       CAN_INTEN_WERRIE             /*!< warning error interrupt enable */
#define CAN_INT_PERR                       CAN_INTEN_PERRIE             /*!< passive error interrupt enable */
#define CAN_INT_BO                         CAN_INTEN_BOIE               /*!< bus-off interrupt enable */
#define CAN_INT_ERRN                       CAN_INTEN_ERRNIE             /*!< error number interrupt enable */
#define CAN_INT_ERR                        CAN_INTEN_ERRIE              /*!< error interrupt enable */
#define CAN_INT_WAKEUP                     CAN_INTEN_WIE                /*!< wakeup interrupt enable */
#define CAN_INT_SLPW                       CAN_INTEN_SLPWIE             /*!< sleep working interrupt enable */

/* function declarations */
/* deinitialize CAN */
void can_deinit(uint32_t can_periph);
/* initialize CAN parameter struct */
void can_struct_para_init(can_struct_type_enum type, void *p_struct);
/* initialize CAN */
ErrStatus can_init(uint32_t can_periph, can_parameter_struct *can_parameter_init);
/* initialize CAN filter */
void can_filter_init(uint32_t can_periph, can_filter_parameter_struct *can_filter_parameter_init);
/* CAN filter mask mode initialization */
void can_filter_mask_mode_init(uint32_t can_periph, uint32_t id, uint32_t mask, can_format_fifo_enum format_fifo, uint16_t filter_number);
/* CAN communication mode configure */
ErrStatus can_monitor_mode_set(uint32_t can_periph, uint8_t mode);

